let course = Number(prompt('Курс нөмірін енгізіңіз: 1, 2, 3, 4'))
let Almaty = prompt('Келген жеріңіз? Алматы ма? Yes  No')

if (1<= course && course<=4){
    alert('Құттықтаймыз! Cізге жаттақханадан орын беріледі')
}
else{
    alert('Өкінішке қарай сізге жатақханадан орын берілмейді')
}  

/*
    alert('Ойын шарты: Дұрыс жауап берілген әр сұраққа 1 балл беріледі')
    let score = prompt('Бірінші сұрақ: Қазақстанның тәуелсіздік алған жылы?')
    let score1 = prompt('Екінші сұрақ: Қазір оқып жатқан қалаңыз?')

    if (score==1991 || score1==Almaty) {
        alert("Сіз 2 ұпай алдыңыз")
    }
    else{
        alert("Сіз 1 ұпай алдыңыз")
    }
        */